# 1)
x1 = "10"
print(x1)
print(type(x1))
print()
x2 = int(x1)
print(x2)
print(type(x2))
print()
x3 = float(x1)
print(x3)
print(type(x3))
print()
# ასევე შეგვიძლია სტრინგში გადაყვანა str() ფუნქციით მარა უკვე სტრინგია მონაცემი

# 2)

z1 = 10
z2 = 15

print(z1 > z2)
print(z1 < z2)
print(z1 >= z2) 
print(z1 <= z2)
print(z1 == z2)
print(z1 != z2)
print()
# მაგალითი მეორე სხვა ციფრებით

y1 = 5
y2 = 7

print(y1 > y2)
print(y1 < y2)
print(y1 >= y2)
print(y1 <= y2)
print(y1 == y2)
print(y1 != y2)
print()


# 3)

# boolean იგივე bool არის ფუნქცია რომელის ასახსნელადაც გამოვიყენებ ნათურას
# ნათუარას ისივე როგორ boolean ფუნქციას აქვს 2 პოზიცია ჩართული ანუ 1 და გამორთული ანუ 0 
# ამ ორ პოზიციას python ში ვხედავთ როგორც True იგივე ჩართული(1) და False იგივე გამორთული(0)
# ამის პითონში გამოყენება შეგვიძლია შედარებით მაგალითად თუ დავწერთ print(5 > 10) აქ მე ვკითხე არის თუ არა 5 უფრო დიდი რიცხვი ვიდრე 10
# ეს მცდარია ასერომ აქ გამოიტანს False ანუ მცდარს თუ დავწერდი print(5 < 10) იქნებოდა True რადგან 10 უფრო დიდი რიცხვია ვიდრე 5