# print არის ინგლისური სიტყვა და ითარგმნება როგორც ბეჭვდა print პითონში კი არის ფუნქცია რომელსაც გამოაქვს ის სიტყვა რაც ჩაიწერება ფრჩხილებში რაც იწერება print ის მერე მაგალითად თუ მინდა გამოვიტანო ეკრანზე ჩემი სახლეი დავწერ print("გიორგი")
# ცვლადი ახსნა ბევრი ხერხით შეილება მარა მე ავხსნი ყუთის დახმარებით
# მაგალითად ჩვენ გვაქვს ბევრი ყუთი რომელშიც სხვადასხვა ნივთს ვინახავთ და რომ არ აგვერიოს ამ ყუთებს ვაწერთ სახელებს მაგალითად ყუთი სადაც კომპიუტერის ნაწილებია დავარქმევთ computer parts ეს იგივეა რაც ცვლადის სახელი ხოლო რაც ინახება ყუთში არის იგივე ცვლადის მნიშვნელობა 
# მაგალითად computer_parts = "CPU, GPU" ეს არის ცვლადი რომელსაც აქვს სახელი მნიშვნელობა და დამაკავშირებელი = ნიშანი ანუ ეს ცვლადი ინახავს მნიშვნელობას რაც არის CPU, GPU


name = "გიორგი"
surname = "მაღალდაძე"
country = "საქართველო"
age = 15

print(name, surname,)
print(country)
print(age)
