# python ში არის ჩვეულებრივი მათემატიკური ოპერაციები როგორებიცაა: მიმატება +, გამოკლება -, გამრავლება *, ახარისხება ** და გაყოფა მაგრამ გაყოფა კიდევ 3 ნაწილად იყოფა
# პითონში 3 სახის გაყოფა გვაქვს პირველი არის ზუსტი გაყოფა / რომელიც გვიჩვენებს ზუსტად რამდენია რიცხვი გაყოფის შედეგად მეორე არის გაყოფა // რომელიც გვიჩვენებს რამდენჯერ მოთავსდება კონკრეტული რიცხვი კონკრეტულ რიცხვში და მესამე ნაშთიანი გაყოფა % რომელიც გვიჩვენებს რამდენია ნაშთი გაყოფის შედეგაგდ

# ცვლადები
a = 7
b = 5

#მათემატიკური ოპერატორები 
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a ** b)
print(a % b)

# ცვლადი price

price = 49
price = price - 12
print(price)

# ცვლადი score 

score = 100
score = score * 35
print(score)

# ახსენით რა შედეგს გამოიტანს ეს კოდი და რატომ
name = 'Barbare'
name = 'Lika'
name = 'Sally'
#name = 'Ninia'
print(name)
# ეს კოდი გამოიტანს შედეგად Sally რადგან ცვლადი შეიცვალა 3 ჯერ და ბოლოს იყო Sally ამიტომაც გამოიტანს Sally მაგრამ თუ name = NiNia ეწერებოდა და არა #name = Ninia მაშინ გამოიტანდა Ninia რადგანაც ეს იყო ბოლო ცვლადი რომელიც შეიცვალა